解析.go文件获取常量的值.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-08-17 三 17:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>解析go源文件得到常量的值</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">解析go源文件得到常量的值</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 问题描述</a></li>
<li><a href="#orgheadline2">2. 实际代码</a></li>
<li><a href="#orgheadline3">3. 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 问题描述</h2>
<div class="outline-text-2" id="text-1">
<p>
我需要一个能够手动解析.go文件程序，获取其中定义的常量的值和之后的注释。这个需求还是很常见的，例如在项目中常把errcode定义为常量，然后需要根据注释解析成errmsg给前端用。但是对于go来说我们不能使用一般的正则来干这件事情，因为在go中iota使用的地方很多，如果要解析得到常量的值的话，用正则太过麻烦。恰好go提供了解析.go文件的包，例如: go/token, go/ast, go/parse等。详细情况可以见：，经过半天折腾，终于完满解决此问题。现在记录在此，不过go的这些包有很多干货啊，以后再深入研究。
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 实际代码</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-go"><span style="color: #F92672;">package</span> main

<span style="color: #F92672;">import</span> <span style="color: #AE81FF;">(</span>
  <span style="color: #E6DB74;">"fmt"</span>
  <span style="color: #E6DB74;">"go/ast"</span>
  <span style="color: #E6DB74;">"go/importer"</span>
  <span style="color: #E6DB74;">"go/parser"</span>
  <span style="color: #E6DB74;">"go/token"</span>
  <span style="color: #E6DB74;">"go/types"</span>
  <span style="color: #E6DB74;">"reflect"</span>
<span style="color: #AE81FF;">)</span>

<span style="color: #F92672;">func</span> <span style="color: #A6E22E;">main</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
  m, _ := <span style="color: #A6E22E;">ParseFile</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"./errcode.go"</span><span style="color: #66D9EF;">)</span>
  fmt.<span style="color: #A6E22E;">Printf</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"%#v"</span>, m<span style="color: #66D9EF;">)</span>
<span style="color: #AE81FF;">}</span>

<span style="color: #F92672;">func</span> <span style="color: #A6E22E;">ParseFile</span><span style="color: #AE81FF;">(</span>fileName <span style="color: #66D9EF;">string</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">(</span><span style="color: #F92672;">map</span><span style="color: #66D9EF;">[</span><span style="color: #66D9EF;">string</span><span style="color: #66D9EF;">]</span><span style="color: #66D9EF;">string</span>, <span style="color: #66D9EF;">error</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
  fset := token.<span style="color: #A6E22E;">NewFileSet</span><span style="color: #66D9EF;">()</span>
  <span style="color: #75715E;">// </span><span style="color: #75715E;">&#35299;&#26512;&#25991;&#20214;&#65292;&#20027;&#35201;&#35299;&#26512;token</span>
  f, err := parser.<span style="color: #A6E22E;">ParseFile</span><span style="color: #66D9EF;">(</span>fset, fileName, <span style="color: #AE81FF;">nil</span>, parser.ParseComments<span style="color: #66D9EF;">)</span>
  <span style="color: #F92672;">if</span> err != <span style="color: #AE81FF;">nil</span> <span style="color: #66D9EF;">{</span>
    <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">nil</span>, err
  <span style="color: #66D9EF;">}</span>

  <span style="color: #75715E;">// </span><span style="color: #75715E;">&#31867;&#22411;&#26816;&#26597;, &#24471;&#21040;&#24120;&#37327;&#30340;&#20540;</span>
  conf := types.<span style="color: #66D9EF;">Config</span><span style="color: #66D9EF;">{</span>Importer: importer.<span style="color: #A6E22E;">Default</span><span style="color: #A6E22E;">()</span><span style="color: #66D9EF;">}</span>
  pkg, err := conf.<span style="color: #A6E22E;">Check</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"cmd/hello"</span>, fset, <span style="color: #A6E22E;">[]</span>*<span style="color: #66D9EF;">ast.File</span><span style="color: #A6E22E;">{</span>f<span style="color: #A6E22E;">}</span>, <span style="color: #AE81FF;">nil</span><span style="color: #66D9EF;">)</span>
  <span style="color: #F92672;">if</span> err != <span style="color: #AE81FF;">nil</span> <span style="color: #66D9EF;">{</span>
    <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">nil</span>, err
  <span style="color: #66D9EF;">}</span>
  m := <span style="color: #F92672;">make</span><span style="color: #66D9EF;">(</span><span style="color: #F92672;">map</span><span style="color: #A6E22E;">[</span><span style="color: #66D9EF;">string</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">string</span><span style="color: #66D9EF;">)</span>
  <span style="color: #F92672;">for</span> _, v := <span style="color: #F92672;">range</span> f.Scope.Objects <span style="color: #66D9EF;">{</span>
    <span style="color: #F92672;">if</span> v.Kind == ast.Con <span style="color: #A6E22E;">{</span>
      d := v.Decl.<span style="color: #E6DB74;">(</span>*<span style="color: #66D9EF;">ast.ValueSpec</span><span style="color: #E6DB74;">)</span>
      m<span style="color: #E6DB74;">[</span>pkg.<span style="color: #A6E22E;">Scope</span><span style="color: #FD971F;">()</span>.<span style="color: #A6E22E;">Lookup</span><span style="color: #FD971F;">(</span>v.Name<span style="color: #FD971F;">)</span>.<span style="color: #FD971F;">(</span>*<span style="color: #66D9EF;">types.Const</span><span style="color: #FD971F;">)</span>.<span style="color: #A6E22E;">Val</span><span style="color: #FD971F;">()</span>.<span style="color: #A6E22E;">String</span><span style="color: #FD971F;">()</span><span style="color: #E6DB74;">]</span> = d.Comment.<span style="color: #A6E22E;">Text</span><span style="color: #E6DB74;">()</span>
    <span style="color: #A6E22E;">}</span>
  <span style="color: #66D9EF;">}</span>
  <span style="color: #F92672;">return</span> m, <span style="color: #AE81FF;">nil</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> 参考资料</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://github.com/golang/example/tree/master/gotypes#introduction">https://github.com/golang/example/tree/master/gotypes#introduction</a> 主要介绍了go/ast, go/token, go/parse等几个包的使用</li>
<li><a href="https://golang.org/pkg/go/">https://golang.org/pkg/go/</a> 标准库文</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-08-17 三 17:06</p>
<p class="validation"></p>
</div>
</body>
</html>
